$(function(){

     var arrPrefix = ['จ้าวกระบี่','เดชไอ้หนุ่ม','ยอดองครักษ์','จอมโหดผยอง','พยัคฆ์มังกร','จ้าวอสูร','ไอ้เณรคะนอง','ยอดนักฆ่า','จ้าวอินทรี','คุณชายสาม','เสี่ยวเอ้อ','ปรมาจารย์บู๊'];
     var arrSuufix = ['หมัดหมูหัน','สะท้านปฐพี','หน้ามืด','เล็บขบ','ฤทธิ์ผีผลัก','พ่อลูกอ่อน','พลังกะปอม','พิทักษ์แม่ม่าย','สะลึมสะลือ','มีสองอีแปะ','ไฟลุกหัว','สามจอกคอพับ','ฤทธิ์ซาลาเปา','หอนางโลม','นิรนาม','เท้าไม่ล้าง','เต้าหู้เหม็น','พันธมิตรไม่พากษ์ให้','แค้นพ่อตาย','ฮับบะช่อ','หาบเร่','พญายม','ผัดหมี่เทวดา','ฟันเหลือง','สามขา','เบี้ยวเปียแชร์','ผู้อาภัพ','ล่าหมี','กลับบ้านเก่า','เขย่าน้ำเต้า','พุทราเชื่อม'];
 
     
      $('#random').click(function(){

         var rmonth = Math.floor(Math.random()*12+1);
         var rday = Math.floor(Math.random()*31+1);
 
         var seletedPrefix = arrPrefix[rmonth-1];
         console.log(seletedPrefix);
 
         var seletedSuufix = arrSuufix[rday-1]; 
         console.log(seletedSuufix);
 
         var result = seletedPrefix + seletedSuufix;


         $('#display').text(result);
 
      });
     
 })





